let handler = m => m 
 handler.all = async function (m) { 
 let chat = global.db.data.chats[m.chat] 
  
   if (/^فعاليات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝قائمة الفعاليات ╎ 📜⌞*
*↻╍╍━┛👑┗━╍╍↺*
*①-『فعالية الجرس╎ 🛎️⌞』*
*②-『فعالية العكس ╎ 🔁⌞』*
*③-『فعالية الفيروسات ╎ 👾⌞』*
*④-『فعالية الرمح والدرع ╎ 🤺⌞』*
*⑤-『فعالية القنبلة ╎ 💣』*
*⑥-『فعالية كرة السلة ╎ 🏀⌞』*
*⑦-『فعالية الديث نوت ╎ ☠️⌞』*
*⑧-『فعالية الافكار╎💡 ⌞』*
*⑨-『فعالية السيارات╎🚗 ⌞』*
*⓪①-『فعالية المطافي╎🚒 ⌞』*
*①①-『فعالية الدونات╎🍩 ⌞』*
*②①-『فعالية باتل رويال╎ ⚔️⌞』*
*③①-『فعالية مصاص الدماء╎🧛🏻‍♂️ ⌞』*
*④①-『فعالية الفقاقيع╎🫧 ⌞』*
*⑤①-『فعالية النرد╎🎲 ⌞』*
*⑥①-『فعالية الدروع╎🛡 ⌞』*
*⑦①-『فعالية أفضل صورة╎🎑 ⌞』*
*⑧①-『فعالية التخمين╎🔍 ⌞』*
*⑨①-『إعلان مسابقة╎🥁 ⌞』*
*⓪②-『جوائز الفعاليات الفردية╎ ⚡⌞』*
*①②-『جوائز الفعاليات الجماعية╎🤹🏻‍♂️ ⌞』*
*②②-『جوائز المسابقة╎💎 ⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
     
 if (/^فعالية الافكار$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الافـكـار╎💡 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*يبداء المقدم بتقديم صور كتابه الخ... علي المشاركين تجميع النقاط لكل ثلاث نقاط فكره💡اول من يجمع خمس افكار يفوز.*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*•الاعتراض بعد الفعاليّة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

   } 
  
 if (/^فعالية الافكار$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الافـكـار╎💡⌞*
*↻╍╍━┛👑┗━╍╍↺*
*①-『』*
*الافكار〔 〕*
*②-『』*
*الافكار〔 〕*
*③-『』*
*الافكار〔 〕*
*④-『』*
*الافكار〔 〕*
*⑤-『』*
*الافكار〔 〕*
*⑥-『』*
*الافكار〔 〕*
*⑦-『』*
*الافكار〔 〕*
*⑧-『』*
*الافكار〔 〕*
*⑨-『』*
*الافكار〔 〕*
*⓪①-『』*
*الافكار〔 〕*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية السيارات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـسيـارات╎🚗 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*❶╎الـفـريـق الأول*
*⟐↫『』*
*⟐↫『』*
*⟐↫『』*
*⟐ القطع〔 〕*
*⟐ البنزين〔 〕*
*╍╍━┛👑┗━╍╍*
*❷╎الـفـريـق الـثـانـي*
*⟐↫『』*
*⟐↫『』*
*⟐↫『』*
*⟐ القطع〔 〕*
*⟐ البنزين〔 〕*
*╍╍━┛👑┗━╍╍*
*❸╎الـفـريـق الـثـالـث*
*⟐↫『』*
*⟐↫『』*
*⟐↫『』*
*⟐ القطع〔 〕*
*⟐ البنزين〔 〕*
*↻╍╍━┛👑┗━╍╍↺*
*❖╎اذا كنـت لا تفهم الفـعـاليـه اقـرأ الـشـرح في جـروب الأعلانات*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية السيارات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـسـيـارات╎🚗 ⌞* 
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*تتكون الفعاليه من ثلاث فرق كل فريق ثلاث اعضاء عليهم تحصيل النقاط لتجيمع السياره والوصول الي خط النهايه كل نقتطين قطعه علي الفريق تجميع 7 قطع لتحريك السياره وجمع 5 من البنزين للوصول لخط النهايه*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*•الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية المطافي$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـمـطـافـئ╎🚒 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*تتكون الفعاليه من خمس فرقاء كل فريق مشاركين علي كل عضو في الفريق اخماد نيران صديقه اول فريق تخمد نيرانه يفوز*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*•الاعـتـراض بـعـد الـفـعـالـيّـة*
*•لا يمكنك اطفاء نيران نفسك*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية المطافي$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـمـطـافـئ╎🚒 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*➊╎الـفـريـق الأول*
*⟐↫『』🔥🔥🔥🔥🔥*
*⟐↫『』🔥🔥🔥🔥🔥*
*╍╍━┛👑┗━╍╍*
*❷╎الـفـريـق الـثـانـي*
*⟐↫『』🔥🔥🔥🔥🔥*
*⟐↫『』🔥🔥🔥🔥🔥*
*╍╍━┛👑┗━╍╍*
*❸╎الـفـريـق الـثـالـث*
*⟐↫『』🔥🔥🔥🔥🔥*
*⟐↫『』🔥🔥🔥🔥🔥*
*╍╍━┛👑┗━╍╍*
*❹╎الـفـريـق الـرابع*
*⟐↫『』🔥🔥🔥🔥🔥*
*⟐↫『』🔥🔥🔥🔥🔥*
*╍╍━┛👑┗━╍╍*
*❺╎الـفـريـق الـخـامـس*
*⟐↫『』🔥🔥🔥🔥🔥*
*⟐↫『』🔥🔥🔥🔥🔥*
*╍╍━┛👑┗━╍╍*
*⟐╎اذا كنـت لا تفهم الفـعـاليـه اقـرأ الـشـرح في جـروب الأعلانات*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الدونات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الــدونــات╎🍩⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*يبداء المقدم بتقديم كتابه صور الخ... ومن يحصل نقطه يختار لون لينقص منه دونات اماكن المشاركين عشوائيه فا ببصاطه تعتمد علي الحظ*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الدونات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـدونـات╎🍩⌞*
*↻╍╍━┛👑┗━╍╍↺*
*『💝』🍩🍩🍩*
*『❤‍🔥』🍩🍩🍩*
*『🤎』🍩🍩🍩*
*『🤍』🍩🍩🍩*
*『🖤』🍩🍩🍩*
*『💜』🍩🍩🍩*
*『💙』🍩🍩🍩*
*『💛』🍩🍩🍩*
*『🧡』🍩🍩🍩*
*『❤️』🍩🍩🍩*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الباتل رويال$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـية الـباتل رويـال╎⚔️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الشــرح📜*

*•يسوي المقدم قروب خاص بالفعالية ويدخلل المشاركين فية*

*• جميع المشاركين بياخذوا إشراف*
 *بنفس الوقت*

*• اول ما يجيكم إشراف عند كلمة أبدا تبدأوا تطردوا*
 *بعض إلى ان يتبقى اخر مشارك*

*❖↫┋المقدم  👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت 🕐╎」*
*❖↫┋الرابط 🪢╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظة❕*
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية مصاص الدماء$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فعالية مصاص الدماء╎🧛🏻‍♂️⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الشـرح╎📜*

*• الفعالـيـة تتكون من 5 اعضاء من البشر و عضو من مصاص دماء واحد , بالنسبة لمصاص الدماء فهو يمتلك 5 قلوب سوداء و بالنسبة للبشر فلديهم 2 قطرة دم*
    
*• يبدأ المقدم بتقديم كـتابـة صور ... الخ، وفي كل جواب صحيح تحصل على نقطة و عند جمعك 2 لنقطتين يمكنك نقص قلب من مصاص الدماء*

*• ما لمصاص الدماء يمكنه ان ينقص 1 قطر دم من بشري عند كل نقطة يحصل عليه*

*• الفائز هو الذي يقتل مصاص الدماء و هو نفسه بالنسبة لمصاص الدماء*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت 🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظة❕*
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية مصاص الدماء$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فعالية مصاص الدماء╎🧛🏻‍♂️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*「」🖤🖤🖤🖤🖤*

*「」🩸🩸*
*「」🩸🩸*
*「」🩸🩸*
*「」🩸🩸*
*「」🩸🩸* 
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الفقاقيع$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـفـقـاقـيـع╎🫧 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*يرسل المقدم دفعات صور او كتابه الخ... وعلي المشاركين اصتياد اكبر عدد من النقاط لكل نقطه ثلاث فقاقيع🫧 اول ثلاث مشاركين يحصلون 50 فقاعه ياخذون المراكز الثلاث الاولي*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*•الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الفقاقيع$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـفـقـاقـيـع╎🫧 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*①-『』*
*الفقاقيع〔 〕*
*②-『』*
*الفقاقيع〔 〕*
*③-『』*
*الفقاقيع〔 〕*
*④-『』*
*الفقاقيع〔 〕*
*⑤-『』*
*الفقاقيع〔 〕*
*⑥-『』*
*الفقاقيع〔 〕*
*⑦-『』*
*الفقاقيع〔 〕*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية النرد$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـنـرد╎🎲 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*يبداء المقدم بـ كتابه صور الخ... مع كل نقطه يستخدم المقدم حجر نرد او روليت اول ثلاث اشخاص يجمعو 30 نقطه يحصلون المراكز الثلاث الاولي*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*•الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية النرد$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـنـرد╎🎲 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*①-『』*
*النقاط〔 〕*
*②-『』*
*النقاط〔 〕*
*③-『』*
*النقاط〔 〕*
*④-『』*
*النقاط〔 〕*
*⑤-『』*
*النقاط〔 〕*
*⑥-『』*
*النقاط〔 〕*
*⑦-『』*
*النقاط〔 〕*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الدروع$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الــــدروع╎🛡️⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*• كل فريق يتكون من شخصين*
*• لكل فريق 3 دروع 🛡️ في البدايه*
*•عند الإجابة على سؤال تختار فريق تكسر درعه ⚒️ او  درع  جديد لديك* 
*• تنتهي الفعاليه عندما تنكسر جميع الدروع ولا يتبقى الا فريق واحد 🥇*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕*
*• الاعتراض بعد الفعاليّة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية الدروع$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الــدروع╎🛡️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*❶╎الـفـريـق الأول╎🛡️🛡️🛡️*
*⟐↫『』*
*⟐↫『』*
*╍╍━┛👑┗━╍╍*
*❷╎الـفـريـق الـثـانـي╎🛡️🛡️🛡️*
*⟐↫『』*
*⟐↫『』*
*╍╍━┛👑┗━╍╍*
*❸╎الـفـريـق الـثـالـث╎🛡️🛡️🛡️*
*⟐↫『』*
*⟐↫『』*
*╍╍━┛👑┗━╍╍*
*❹╎الـفـريـق الـرابـع╎🛡️🛡️🛡️*
*⟐↫『』*
*⟐↫『』*
*╍╍━┛👑┗━╍╍*
*❺╎الـفـريـق الـخـامـس╎🛡️🛡️🛡️*
*⟐↫『』*
*⟐↫『』*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية افضل صورة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة أفـضـل صـورة╎🎑⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـــرح📜*

*• كل شخص يريد يشارك بيرسل صورة انمي للمقدم بالخاص، وعند بدء الفعاليّة المقدم بيحط صورتين من صور المشاركين والاعضاء رح يصوتو للصورة الأفضل ويمنع التصويت لنفسك وصاحب أعلى تصويت يتأهل، والي يفوز تنحط صورته كـصوره للجروب*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕*
*• الاعـتـراض بـعـد الـفـعـالـيـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية التخمين$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـتـخـمـيـن╎🔍⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح╎📜*

*•بإختصار فكرة المارد الأزرق,المقدم يحط براسه شخصية و انتم دوركم تسألوا المقدم اسئله وهو يقوم بالاجابة على اسئلتكم باحد هذه الأجوبة التالية { نعم - لا - لا اعلم - من الممكن}*
*• يتوقف المشاركون عن الأسئلة عندما يغلقها المقدم*
*•المقدم بيعلن عن الشخصية بعد ما يجاوب جميع المتسابقين*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕*
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^فعالية التخمين$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فــعـالـيـة الـتـخـمـيـن╎🔍⌞*
*↻╍╍━┛👑┗━╍╍↺*

*①-『』*
*النقاط〔 〕*
*②-『』*
*النقاط〔 〕*
*③-『』*
*النقاط〔 〕*
*④-『』*
*النقاط〔 〕*
*⑤-『』*
*النقاط〔 〕*
*⑥-『』*
*النقاط〔 〕*
*⑦-『』*
*النقاط〔 〕*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^اعلان مسابقة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إعــلان مـسـابـقـة╎🥁 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*⨀⇠ الاسـئــلـة❔『』*
*⨀⇠ الـــصــور 🎴『』*
*⨀⇠ الـكــتـابـة📋『』*
*⨀⇠ الـطـلبات ⚔️『』*
*⨀⇠ المقولات 💬『』*
*⨀⇠ الايموجي🫥『』*
*⨀⇠ اول حرف🔂『』*
*⨀⇠ آخر حرف☑️『』*

*❖↫┋الـمـقـدم 👨🏻‍💻╎」*
*❖↫┋الـوقــت 🕑╎」*
*❖↫┋عدد الاسئلة🔢╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕*
*• اول إجابة تظهر للمقدم تحتسب*
*• يمنع السوالف وارسال الصور يأتي ورائها مخالفة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^جوائز الفعاليات الفردية$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ جــوائـز الـفـعـالـات الفردية╎⚡ ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*⨀ المركز الاول🥇╎」『70』*

*⨀ المركز الثاني🥈╎」『60』*

*⨀ المركز الثالث🥉╎」『50』*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ بـقـيـة الـمـشـاركـيـن🏅*

*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*

*⨀ الـمـقـدم 👨🏻‍💻╎」『50』*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
    if (/^نتائج المسابقة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ نـتـائـج الـمـسـابـقـه╎💎 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*⨀ المركز الاول🥇╎」『70』*

*⨀ المركز الثاني🥈╎」『60』*

*⨀ المركز الثالث🥉╎」『50』*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ بـقـيـة الـمـشـاركـيـن🏅*

*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*
*⨀╎」『20』*

*⨀ الـمـقـدم 👨🏻‍💻╎」『50』*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
       if (/^جوائز الفعاليات الجماعية$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⦗ ● جـــؤائــز الفــعاليات الجماعية🌟🤹🏻‍♂️ ●⦘*
*◉─━━ ━━─ ◞👑◜ ─━━ ━━─◉*
*❖╎المقدم 👨🏻‍🏫『』*
*※-الجائزه ☜ 50k*
*◆ ━━─ ⊱⋅الفأئزين🏆⋅⊰ ─━━ ◆*
*◈↤◞الفريق الأول🥇 70k◜*
*①-「」*
*②-「」*

*◈↤◞الفريق الثاني🥈 60k◜*
*①-「⁩」*
*②-「」*

*◈↤◞الفريق الثالث🥉 40k◜* 
*①-「⁩」*
*②-「⁩」*

*◈↤◞باقي المشاركين🏅30k◜*
*①-「⁩」*
*②-「」*
*③-「」*
*④-「」*
*◉─━━ ━━─ ◞👑◜ ─━━ ━━─◉*
*⟐ تــوقــيــع╎↓*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
       if (/^استمارات النقابة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*❆┇『استمـارات النقابـة╎ 📓⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*➊┇『الـدخول╎ ⛩️⌞』*
*➋┇『التـرحيـب╎ 🎉⌞』*
*➌┇『أنـذار╎ 🚨⌞』*
*➍┇『طـرد╎ 🚫⌞』*
*➎┇『تـرقيـة╎ 📈⌞』*
*➏┇『أعفـاء╎ 📉⌞』*
*➐┇『شراء سلعـة╎ 🛒⌞』*
*➑┇『تحـويل بيلي╎ 🪙⌞』*
*➒┇『تغييـر للقـب╎ 💱⌞』*
*➓┇『الأسئـالة المفاجئة╎ ⁉️⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
       if (/^فعالية الجرس$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـجـرس╎🛎️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح╎📜*

*• يقوم المقدم بإرسال صورة او سؤال و اول شخص يقوم بإرسال ايموجي جرس 🛎️يسمح له بالإجابة*

*• مدة وقت الإجابة 20 ثانية إن لم يجيب على سؤال يجمد لـ سؤالين*
*• من يرسل جرس🛎️ ويجاوب خطأ يجمد لـ سؤالين*

*❖↫┋المقدم👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين🔢╎」*
*❖↫┋الوقت 🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه ❕*
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
       if (/^فعالية الجرس$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فــعـالـيـة الـجـرس╎🛎️⌞*
*↻╍╍━┛👑┗━╍╍↺*

*①-『』*
*النقاط〔 〕*
*②-『』*
*النقاط〔 〕*
*③-『』*
*النقاط〔 〕*
*④-『』*
*النقاط〔 〕*
*⑤-『』*
*النقاط〔 〕*
*⑥-『』*
*النقاط〔 〕*
*⑦-『』*
*النقاط〔 〕*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
       if (/^فعالية العكس$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـعـكـس╎🔁⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الـشـرح📜*

*فعاليه عاديه لاكن الفرق بينهم انه لا يتم استخدام فقرات غير العكس ويحدد المقدم عدد النقاط التي يجب الحصول عليها للفوز*
*شرح فقره العكس↓*
*~ليفاي≈يافيل~*
*~لوفي≈يفول~*

*❖↫┋المقدم 👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕* 
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية العكس$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فــعـالـيـة الــعـكـس╎🔁⌞*
*↻╍╍━┛👑┗━╍╍↺*

*①-『』*
*النقاط〔 〕*
*②-『』*
*النقاط〔 〕*
*③-『』*
*النقاط〔 〕*
*④-『』*
*النقاط〔 〕*
*⑤-『』*
*النقاط〔 〕*
*⑥-『』*
*النقاط〔 〕*
*⑦-『』*
*النقاط〔 〕*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية الفيروسات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فعالية الفيروسات╎👾 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*❖↫ الشــرح📜*

*• كل مشارك يمتلك حاسـ💻ـوب كل نقطة تاخذها تمتلك فيـ👾ـروس واحد ترسله لمشارك من اختيارك و اذا تم إختراقك من ثلاث فيروسات سوف تخسر*

*❖↫┋المقدم  👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت 🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظة❕*
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية الفيروسات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـفـيروسـات╎👾 ⌞* 
*↻╍╍━┛👑┗━╍╍↺*

*「」💻💻💻*
*「」💻💻💻*
*「」💻💻💻*
*「」💻💻💻*
*「」💻💻💻*
*「」💻💻💻* 

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية الرمح$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فعالية الرمح والدرع╎🤺⌞* 
*↻╍╍━┛👑┗━╍╍↺*

*الـفـريـق الأول『🛡️🛡️』*
*• حامل الدرع🛡️『』*
*• حامل الرمح🏹『』*🛡
*╍╍━┛👑┗━╍╍*
*◈ الـفـريـق الـثـانـي 『🛡️🛡️』*
*• حامل الدرع🛡️『』*
*• حامل الرمح🏹『』*🛡️
*╍╍━┛👑┗━╍╍*
*◈ الـفـريـق الـثـالـث『🛡️🛡️』*
*• حامل الدرع🛡️『』*
*• حامل الرمح🏹『』*🛡️
*╍╍━┛👑┗━╍╍*
*◈ الـفـريـق الـرابـع『🛡️🛡️』*
*• حامل الدرع🛡️『』*
*• حامل الرمح🏹『』*🛡️
*╍╍━┛👑┗━╍╍*
*◈ الـفـريـق الـخـامـس『🩸』*
*• مـجـهـول🥷🏻『』*🛡️🛡️

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظة❕*
*في حال عدم فهمك للفعالية راجع القوانين في الاعلانات*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية القنبلة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـقـنـبـلـة╎💣 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ الشـرح╎📜*

*•  مشارك يعيش في كوخ صغير⛺*

*• عند الفوز بنقطتين متتاليتين تحصل على قنبلة💣 ترسلها ل كوخ أحد خصومك*

*• المشارك اللذي يتلقى 3 قنابل يخسر*

*❖↫┋المقدم  👨🏻‍🏫╎」*
*❖↫┋عدد المشاركين 🔢╎」*
*❖↫┋الوقت 🕐╎」*

*↻╍╍━┛👑┗━╍╍↺*
 *⟐╎ملاحظة❕*
*• الاعـتـراض بـعـد الـفـعـالـيّـة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية القنبلة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة الـقـنـبلـة╎💣 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*「」🛖*
*「」🛖*
*「」🛖*
*「」🛖*
*「」🛖*
*「」🛖* 
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية كرة السلة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة كـرة الـسـلـة╎🏀 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫ شرح الفعالية📜*

*تتكون اساس اللعبة من فريقين كل فريق عدد اعضائه 5  وكل فريق يملك 10 كرات سيقوم المقدم بتقديم اللعبه وسيقوم بطرح الاسئلة او ارسال الصور وعندما تتم الاجابه من احد اعضاء الفريق سيتم اخذ اول اجابه وسيتم خصم كوره من الفريق واضافتها الى الفريق الاخر بنتيجة 9-11 وتستمر اللعبه حتى يفقد الفريق كل كراته وتضاف الى الفريق الاخر بمجموع 0-20 وسيتم اعلان الفريق الفائز*

*❖↫┋التسجيل : عام في القروب الاساسي*

*❖↫┋المقدم  👨🏻‍🏫╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملاحظه❕*
*• الاعتراض بعد الفعاليّة*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
          if (/^فعالية كرة السلة$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ فـعـالـيـة كـرة الـسـلـة╎🏀 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
*❖↫┋الفريق الاول 〔10〕*
〔〕
〔〕
〔〕
〔〕
〔〕
*╍╍━┛👑┗━╍╍*
*❖↫┋الفريق الثاني〔10〕*
〔〕
〔〕
〔〕
〔〕
〔〕

*❖↫┋الـمـقـدم 🧑🏻‍💻╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
     if (/^لوفي الاستمارات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*┇『لوفـي الاستمـارات╎ 📑⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*➊┇『استمـارات النقابـة╎ 📓⌞』*
*➋┇『استمارات الاداره╎ ⚜️⌞』*
*➌┇『استمـارات الفعاليات╎ 🤹🏻‍♂️⌞』*
*➍┇『استمـارات المطـور╎ 👨🏻‍💻⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 }  if (/^مهام المشرفين$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
 *⌝الـمـهـام الـيـومـيـة للـمـشـرفـيـن╎📜⌞*
*↻╍╍━┛👑┗━╍╍↺*
*❍↵┆『』*
*↲ 〘〙*
*❍↵┆『』*
*↲ 〘〙*
*❍↵┆『』*
*↲ 〘〙*
*❍↵┆『』*
*↲ 〘〙*
*↻╍╍━┛👑┗━╍╍↺*
*~⌬ تــ✍︎ــوقــيــع ↡~*
*~⟦𝙻𝚄𝙵𝙵𝚈 𓆩👑𓆪 𝙱𝙾𝚃⟧~*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } if (/^استمارات الاداره$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*❆┇『استمـارات الإدارة╎ ⚜️⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*➊┇『مهـام المشـرفين╎ 🤵🏻‍♂⌞』*
*➋┇『تأجيل الفعاليـة╎ 💔⌞』*
*➌┇『استئناف الفعاليـة╎ ❤️⌞』*
*➍┇『تحـديث البنك╎ 🏦⌞』*
*➎┇『تحـديث المنشن╎ 📧⌞』*
*➏┇『النقـاشات╎ 📒⌞』*
*➐┇『جائـزة البكج╎ 💰⌞』*
*➑┇『ملـوك الأسبوع╎ 👑⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } if (/^تحديث المنشن$/i.test(m.text) ) { //sem prefixo 
    conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*⌝📧╎تـم تـحـديـث الـمـنـشـن╎📧⌞*
*❍↵┆تـاريـخ الـتـحـديـث⇠『 /  / 』*
*↻╍╍━┛👑┗━╍╍↺*
*» الـمـحـدث👨🏻‍💻⇠「」*
*↻╍╍━┛👑┗━╍╍↺*
*↯╎🌀مـسـؤولـيـن الـمـنـشـن🌀╎↯*
*•『 ┇ 』•*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

    } if (/^ملوك الاسبوع$/i.test(m.text) ) { //sem prefixo 
    conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*↯┋تـعـلـن إدارة الـنـقـابـة عـن┋↯*
*❆╎⇩ 🎉مــلــوك الأســبــوع🎉 ⇩╎❆*
*↻╍╍━┛👑┗━╍╍↺*
*〄⇜⚜️╎مـلـك الـكـلانـات⌉*
*↲ 〘╎@〙*
*⌬╎الـجـائـزة🪙⇠〘500〙*
*↻╍╍━┛👑┗━╍╍↺*
*〄⇜🖌️╎مـلـك الـتـقـديـم⌉*
*↲ 〘╎@〙*
*⌬╎الـجـائـزة🪙⇠〘500〙*
*↻╍╍━┛👑┗━╍╍↺*
*〄⇜📊╎مـلـك الـتـفـاعـل⌉*
*↲ 〘╎@〙*
*⌬╎الـجـائـزة🪙⇠〘500〙*
*↻╍╍━┛👑┗━╍╍↺*
*〄⇜💬╎مـلـك الـنـقـاشـات⌉*
*↲ 〘╎@〙*
*⌬╎الـجـائـزة🪙⇠〘300〙*
*↻╍╍━┛👑┗━╍╍↺*
*~〄 تــ✍︎ــوقــيــع ↡~*
~*⟦𝙻𝚄𝙵𝙵𝚈 𓆩👑𓆪 𝙱𝙾𝚃⟧*~
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

    } if (/^جائزة البكج$/i.test(m.text) ) { //sem prefixo 
                 conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*❆┇『جائزة البكـج╎ 💰⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*⌬╎الـجـائـزة💰⇠〘〙*
*↻╍╍━┛👑┗━╍╍↺*
*⌬╎الـفـائـز 🤵🏻‍♂⇠〘〙*
*↻╍╍━┛👑┗━╍╍↺*
*~⌬ تــ✍︎ــوقــيــع ↡~*
*~⟦𝙻𝚄𝙵𝙵𝚈 𓆩👑𓆪 𝙱𝙾𝚃⟧~*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

                 } if (/^تحديث البنك$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*❍ ╹ تـم تــحـديـث الـبـنـك 🏦*
*❍ ╹ تـاريـخ التـحــ💫ـديـث ⇠『    /    /    』*
*↻╍╍━┛👑┗━╍╍↺*
*❍ ╹ المـحـدث 🤵🏻‍♂⇠『  』*
*❍ ╹ رابـط الـبنـك 🏦⇠『  』*
*↻╍╍━┛👑┗━╍╍↺*
*❍ ╹ مـسـؤولـيـن الـبـنـك 🏦*
*『 ┇ 』*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } if (/^الفعالية تتأجل$/i.test(m.text) ) { //sem prefixo 
    conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
             *❖┇الفعالية تتأجل 💔*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

    } if (/^الفعالية تستأنف$/i.test(m.text) ) { //sem prefixo 
        conn.reply(m.chat, `『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』
             ❖┇الفعالية تستأنف ❤️
『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

        } if (/^النقاشات$/i.test(m.text) ) { //sem prefixo 
                  conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إفـتــتـاح نــقــاش╎📒 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋عـنـوان النـقـاش 🔖╎」*

*❖↫┋الـمـقـدم 👨🏻‍🏫╎」*

*❖↫┋عدد المشاركين 🔢╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

                  } if (/^النقاشات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ انـتـهــاء نــقــاش╎📍⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋عـنـوان الـنـقـاش 🔖╎」*

*❖↫┋الـمـقـدم  👨🏻‍🏫╎」* 

*❖↫┋جـوائـز الـنـقـاش 🪙 『50k』*

*❖↫┋المشاركين🎭:-*
*『』*
*『』*
*『』*
*『』*
*『』*
*『』*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     }
               if (/^الدخول$/i.test(m.text) ) { //sem prefixo 
                 conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝إسـتـمـارة الـدخـول╎📜 ⌞* 
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋إختر لقبك 🎭╎」*

*❖↫┋اللقب من اي انمي 📺╎」*

*❖↫┋ولد او بنت 🎎╎」*

*❖↫┋من طرف من دخلت👥╎」*

*❖↫┋أفضل انمي لك🕯️╎」*

*❖↫┋صوره لـ لقبك 🖼️╎」*
*↻╍╍━┛👑┗━╍╍↺*
*⟐╎وأهلاً بك نورتنا يامن حلت عليه البركه في نقابتنا العريقة💞.*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

                 }if (/^الترحيب$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إسـتـمـارة تـرحـيـب╎🎉 ⌞*
*↻╍╍━┛👑┗━╍╍↺*
🌟 ﷽🌟 
*تـتـلاحـق الـعـبارات ، تـتـسابق الـكلـمات ، يـتنـاثـر الـورد لـيرحـب بـنجـم جـديـد انـار عـائـلـتنـا الـكريـمـه*


*❖↫┋الـلـقـب 🥢╎」*

*❖↫┋الأنمي☄️╎」*

*❖↫┋الـمـنـشـن 📧╎ 」*

*❖↫┋مـن طـرف 👥╎」*

*❖↫┋رابط الإعلانات*
*『  』*
*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ملحوظه هامة*
*نرجو منك سيدي الاوتاكو سيدتي الاوتاكو الإلتزام بالقوانين وقرائتها واذا واجهت اي مشكله توجه الى احد المشرفين  وسوف نساعدك🙂👋🏻*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     }if (/^ترقية$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إعــلان تـرقــيــه╎⚡⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الـلـقـب👤╎」*

*❖↫┋الـرتـبـه الـسابـقـه👨🏻‍💻╎」*

*❖↫┋الـتـرقـيـه🦸🏻‍♂️╎」*

*❖↫┋المنشن الخاص به📧╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎نـتـمـنى مـنـه الـعـون والـسـداد لـلـنقـابـة 💞.*
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^أعفاء$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝إعلان إعفاء مشرف╎💔⌞* 
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الـلـقـب 👤╎」*

*❖↫┋مـن مـنصب⚡╎」*

*❖↫┋إلـى مـنصب⛓️╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⟐╎ نشكرك على كل ما قدمته من اجل النقابة ونتمنى لك التوفيق💞.* 
*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^الأسئالة المفاجئة$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إعـلان سـؤال مـفـاجـئ╎🛎️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الــنــوع  🔗╎」*

*❖↫┋الـــســؤال 🖋️╎」*

*❖↫┋المقدم 👨🏻‍💻╎」*

*❖↫┋المستوى 📊╎」*

*❖↫┋الــوقــت🕑╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^الأسئالة المفاجئة$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إجـابـة الــســؤال╎🎗️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الـفـائـز🎖️╎」*

*❖↫┋الإجـابـة 📝╎」*

*❖↫┋الـجـائـزة💰╎」*

*❖↫┋الـمـقـدم👨🏻‍💻╎」* 

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^تحويل بيلي$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ تـحـويـل بـيـلـي╎🪙 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الــمـحـول 🔂╎」*

*❖↫┋المبلغ الذي تم تحويلة 💱╎」*

*❖↫┋المحول إليه 👤╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^تغيير لقب$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إعـلان تـغـييـر لقـب╎💱 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الـلـقب السابـق 👤╎」*

*❖↫┋الـلـقب الحـالـي 🥢╎」*

*❖↫┋الـمـنـشـن 🌀╎」*

*❖↫┋الـسعـر 💰╎200k」*

*❖↫┋مسؤول الالقاب 👨🏻‍💻╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^شراء سلعة$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إعـلان شـراء سـلـعـة╎🛍️ ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋المـشتـري 👤╎」*

*❖↫┋الـسعـر 💰╎」*

*❖↫┋الـسلـعـة 📦╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^طرد$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ إعـلان طـــرد╎💢 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋ الـلـقـب👤╎」*

*❖↫┋الـمـنـشـن🌀╎」*

*❖↫┋الـسـبـب⁉️╎」*

*❖↫┋ الـمـده⏳╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^لوفي زخرفات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*❆┇『لـوفي زخرفات╎ 〽️⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*①-『زخـرفات أرقـام╎ 🔢⌞』*
*②-『زخـرفات اقـواس╎ 🖇️⌞』*
*③-『زخـرفات نقـاط╎ ⭕⌞』*
*④-『زخـرفات للأستمـارات╎ 📑⌞』*
*⑤-『زخـرفات اخـرى╎ ♻️⌞』*
*⑥-『زخـرفات المطـور╎ 👨🏻‍💻⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^لوفي شروحات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*❆┇『لـوفي شروحـات╎ 📃⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*①-『شـرح كيف تصمم موقع خاص بك على جوجل كـروم╎ 🌐⌞』*
*②-『شـرح كيف تحصلل على أرقام وهمية╎ 🔢⌞』*
*③-『شـرح كيف تعدلل على جميع التطبيقات╎ ♻️⌞』*
*④-『شـرح كيف ترشق لجميع مواقع التواصل الاجتماعي╎ 〽️⌞』*
*⑤-『شـرح كيف تصمم فيديوهات وصور بأحتراف╎ 🎥⌞』*
*⑥-『شـرح كيف تحصلل على بطاقات فيزا مجانً╎ 🎫⌞』*
*⑦-『شـرح كيف تحظر أرقام دون أستخـدام نسخ العكس╎ ⛔⌞』*
*⑧-『شـرح كيف تسووي بوتات على التلجرام╎ 🤖⌞』*
*⑨-『شـرح كيف تنشئ مـوقع SMM مجـانً╎ ✅⌞』*
*⓪①-『شـرح كيف تستخـدم بووت لوفي╎ 📄⌞』*
*↻╍╍━┛👑┗━╍╍↺*
*❆『أنتظـرونا في أقـوى الشروحات إن شاء الله』*
*❆『لطلب أضافة شرح الى البوت الـرجاء مراسللة المطـور👨🏻‍💻』*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^زخرفات ارقام$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `____
₁₉₉₅
₁₉₉₆
₁₉₉₇
₁₉₉₈
₁₉₉₉
₂₀₀₀
₂₀₀₁
₂₀₀₂
₂₀₀₃
_
¹ ² ³ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ¹⁰ ¹¹ ¹² ¹³ ¹⁴ ¹⁵ ¹⁶ ¹⁷ ¹⁸ ¹⁹ ²⁰ ²¹ ²² ²³ ²⁴ ²⁵ ²⁶ ²⁷ ²⁸ ²⁹ ³⁰ ³¹ ³² ³³ ³⁴ ³⁵ ³⁶ ³⁷ ³⁸ ³⁹ ⁴⁰ ⁴¹ ⁴² ⁴³ ⁴⁴ ⁴⁵ ⁴⁶ ⁴⁷ ⁴⁸ ⁴⁹ ⁵⁰ ⁵¹ ⁵² ⁵³ ⁵⁴ ⁵⁵  ⁵⁶ ⁵⁷ ⁵⁸ ⁵⁹ ⁶⁰ ⁶¹ ⁶³  ⁶⁴ ⁶⁵ ⁶⁶ ⁶⁷ ⁶⁸ ⁶⁹ ⁷⁰ ⁷¹ ⁷² ⁷³ ⁷⁴ ⁷⁵ ⁷⁶ ⁷⁷ ⁷⁸ ⁷⁹ ⁸⁰ ⁸¹ ⁸² ⁸³ ⁸⁴ ⁸⁵ ⁸⁶ ⁸⁷ ⁸⁸ ⁸⁹ ⁹⁰ ⁹¹ ⁹² ⁹³ ⁹⁴ ⁹⁵ ⁹⁶ ⁹⁷ ⁹⁸ ⁹⁹ ¹⁰⁰ .
___
❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ➀ ➁ ➂ ➃ ➄ ➅ ➆ ➇ ➈ ➉ ➊ ➋ ➌ ➍ ➎ ➏ ➐ ➑ ➒ ➓
⓵ ⓶ ⓷ ⓸ ⓹ ⓺ ⓻ ⓼ ⓽ ⓾
 ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⑩ ⑪ ⑫ ⑬ ⑭ ⑮ ⑯ ⑰ ⑱ ⑲ ⑳`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^زخرفات نقاط$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `╙ ╓ ╕╜☜☞☟卐☆★♢♯♭♬♪◈◑▧▦▥▤▩▨◐°✈✔✓✒✑✐✘✙✚✛✗✖✜✠✦✥✤✣✢✧✮✭✬✫✪✩✯✰✲✳✴✺✹✸✷✶✵❀✿✾✽✼✻❁❂❃❅❆❋❊❉❈❇❘❖⌬◉◥🂡❀⌫〄☘︎✠❆❉✦◈❐⌨︎❍ ᝅ ⚇⚉ ٭ «»☻ Ͳͳ ৷ ⚔ ₁₂₃₄₅₆₇₈₉ 𖧹 𖢇 𖢊 𖡼 𖡡 【】 ⛯⛮⛭ ☩ ⛃⛁ ⊗⛏ ⛣ ⛛ ☊☋ ══ ◈ ⸙ ✙ ◆ ◤◢ ❈ ࿇ ᯽ ⚊ ⍜། ༜ ༤ ࿉ ࿂ ࿃ ࿄ ࿅ ᨊᨉ ᨖ ᨞ ᳀ ⁌ ⁍ ⁕ ⁂⌗ ⍭ ⎜ ⎉⎊⎐⎒ ┨ ┃❍ ⟽ ⟞⟝  ꒿ ꖅ   ﹅﹆ ─||─ ᗢ 𖠀 𖠁 𖠄 𖠕 𖠰 𖠷 𖠺 𖠸 𖡗 𖡙 𖡋 𖡟 𖡤 𖡦 𖣃 𖣘 𖣐 𖥔 𖥕 𖧹 ¤ 〓〄⭖ ⬮⬯ ⫷ ⩤⩥ ⨴⨵ ⨂⨁⨀ ⟣⟢ ❨❩ ❅ ❆ ⛒ ↈ ⋎⋏⚬ ⚷ ☗☖ ◺◿◹◸ ◫◧ ◖◗ ●◎◍◔◕ ▱▰ ⌕ ⋐⋑ ⊹ ⊘ ⋋⋌  ᴥ ᵜ ᪣  ૦ ⇦ ⇷ ꕺ ꕻ ꔹ ✾ ≛ ₪ ⌬ ⌹ ∩∪⊍⊎ ⊏⊐ ⊑⊒⌦⌫ ⍃⍄ ⍅⍆ ⍣ ⍟ ⩚ ⩛ ⪦ ⪧♧♤ ❊ ࿊࿋࿌ ⟲⟳ ⟱⟰ ◇ ⎔༺༻ ࿗࿖࿘࿕  ✦  ❉  ✠  ❀❁✣✤  ⊰⊱  ✺  ┣  ★☆✩✬✭✮✯  ❝❞  ♜♘♞♟♙♝♗♔♕♖♛♚ ᕬᕰᕱ ☘︎ ━ ☽☾ ⚚ ⛬ 𖡺`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^زخرفات اخرى$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `← ↑ → ↓ ↔ ↕ ↖ ↗ ↘ ↙ ↚ ↛ ↜ ↝ ↞ ↟ ↠ ↡ ↢ ↣ ↤ ↥ ↦ ↧ ↨ ↩ ↪ ↫ ↬ ↭ ↮ ↯ ↰ ↱ ↲ ↳ ↴ ↵ ↶ ↷ ↸ ↹ ↺ ↻ ↼ ↽ ↾ ↿ ⇀ ⇁ ⇂ ⇃ ⇄ ⇅ ⇆ ⇇ ⇈ ⇉ ⇊ ⇋ ⇌ ⇍ ⇎ ⇏ ⇐ ⇑ ⇒ ⇓ ⇔ ⇕ ⇖ ⇗ ⇘ ⇙ ⇚ ⇛ ⇜ ⇝ ⇞ ⇟ ⇠ ⇡ ⇢ ⇣ ⇤ ⇥ ⇦ ⇧ ⇨ ⇩ ⇪ ⇫ ⇬ ⇭ ⇮ ⇯ ⇰ ⇱ ⇲ ⇳ ⇴ ⇵ ⇶ ⇷ ⇸ ⇹ ⇺ ⇻ ⇼ ⇽ ⇾ ⇿➩ ➪ ➫ ➬ ➭ ➮ ➯ ➱ ➲ ➳ ➴ ➵ ➶ ➷ ➸ ➹ ➺ ➻ ➼ ➽ ➾ ⟀  ⟐  ⟜ ⟝ ⟞ ⟟ ⟠ ⟡ ⟢ ⟣ ⟤ ⟥ ⟪ ⟫ ⟰ ⟱ ⟲ ⟳ ⟴ ⟵ ⟶ ⟷ ⟸ ⟹ ⟺ ⟻ ⟼ ⟽ ⟾ ⟿ ⤀ ⤁ ⤂ ⤃ ⤄ ⤅ ⤆ ⤇ ⤈ ⤉ ⤊ ⤋ ⤌ ⤍ ⤎ ⤏ ⤐ ⤑ ⤒ ⤓ ⤔ ⤕ ⤖ ⤗ ⤘ ⤙ ⤚ ⤛ ⤜ ⤝ ⤞ ⤟ ⤠ ⤡ ⤢ ⤣ ⤤ ⤥ ⤦ ⤧ ⤨ ⤩ ⤪ ⤫ ⤬ ⤭ ⤮ ⤯ ⤰ ⤱ ⤲ ⤳ ⤴ ⤵ ⤶ ⤷ ⤸ ⤹ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⥂ ⥃ ⥄ ⥅ ⥆ ⥇ ⥈ ⥉ ⥊ ⥋ ⥌ ⥍ ⥎ ⥏ ⥐ ⥑ ⥒ ⥓ ⥔ ⥕ ⥖ ⥗ ⥘ ⥙ ⥚ ⥛ ⥜ ⥝ ⥞ ⥟ ⥠ ⥡ ⥢ ⥣ ⥤ ⥥ ⥦ ⥧ ⥨ ⥩ ⥪ ⥫ ⥬ ⥭ ⥮ ⥯ ⥰ ⥱ ⥲ ⥳ ⥴ ⥵ ⥶ ⥷ ⥸ ⥹ ⥺ ⥻ ⥼ ⥽ ⥾ ⥿ ⬈ ⬉ ⬊ ⬋  ⬀ ⬁ ⬂ ⬃ ⬄`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^زخرفات للاستمارات$/i.test(m.text) ) { //sem prefixo 
      conn.reply(m.chat, `𓆊 . 𓅛 . 𓃕 . 🝭 . 𝆄 . 𖤽 . 𝄆 . 𖤾 . 𓏫 . 𓄌 . 𓇡 . 𓋜 . ⍥⃝   . ꕥ  . ⌘ . ♾ .    ꙰  .  . ᤑ .  ﾂ .
__
✦ ,✫ ,✯, ✮ ,✭ ,✰, ✬ ,✧, ✤, ❅ , 𒀭,✵ , ✶ , ✷ , ✸ , ✹ ,⧫,
__
𖠀 𖠁 𖠂 𖠃 𖠄 𖠅 𖠆 𖠇 𖠈 𖠉 𖠊 𖠋 𖠌 𖠍 𖠎 𖠏 𖠐 𖠑 𖠒 𖠓 𖠔 𖠕 𖠖 𖠗 𖠘 𖠙 𖠚 𖠛 𖠜 𖠝 𖠞 𖠟 𖠠 𖠡 𖠢 𖠣 𖠤 𖠥 𖠦 𖠧 𖠨 𖠩 𖠪 𖠫 𖠬 𖠭 𖠮 𖠯 𖠰 𖠱 𖠲 𖠳 𖠴 𖠵 𖠶 𖠷 𖠸 𖠹
__
 ✚ ✛ ✜  ✞ ✟ ✠  卍 ↺ ↻  〄 – — ‘ ’ ‚ “ ” „ † ‡ • … ‰ ‹ › ※ ‽ ⁂ ⁄ € ™ ← ↑ → ↓ ⇧ √ ∞ ∴ ∵ ≈ ≠ ⌃ ⌘ ⌥ ◊ ●  ★ ☆ ☜  ☞ ☟  ✎
_
𓋆 . 𓆃 . 𖠋 . 𖥳 .𖠛 .𖣂 .𓂐.ᝰ‌ . ꫂ . 𓂀 . 𝆹𝅥𝅮 .𓊮 .𓇼 .𓄯 .𓄧 . 𓆦 . 𓍴 . 𓌗 .⸙ .𓂇 .

ꕤ . ⋆ . ꕥ . ➺ . ᤑ .  ײַ  . ঌ . ༯ .𖣔 .𖤐 . 
あ . ⊀ .  . 𓃚 .𖤍. 𖣴 . 𖤐.
__`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      } if (/^زخرفات للاستمارات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `𓆊 . 𓅛 . 𓃕 . 🝭 . 𝆄 . 𖤽 . 𝄆 . 𖤾 . 𓏫 . 𓄌 . 𓇡 . 𓋜 . ⍥⃝   . ꕥ  . ⌘ . ♾ .    ꙰  .  . ᤑ .  ﾂ .
   __
   ✦ ,✫ ,✯, ✮ ,✭ ,✰, ✬ ,✧, ✤, ❅ , 𒀭,✵ , ✶ , ✷ , ✸ , ✹ ,⧫,
   __
   𖠀 𖠁 𖠂 𖠃 𖠄 𖠅 𖠆 𖠇 𖠈 𖠉 𖠊 𖠋 𖠌 𖠍 𖠎 𖠏 𖠐 𖠑 𖠒 𖠓 𖠔 𖠕 𖠖 𖠗 𖠘 𖠙 𖠚 𖠛 𖠜 𖠝 𖠞 𖠟 𖠠 𖠡 𖠢 𖠣 𖠤 𖠥 𖠦 𖠧 𖠨 𖠩 𖠪 𖠫 𖠬 𖠭 𖠮 𖠯 𖠰 𖠱 𖠲 𖠳 𖠴 𖠵 𖠶 𖠷 𖠸 𖠹
   __
   ✚ ✛ ✜  ✞ ✟ ✠  卍 ↺ ↻  〄 – — ‘ ’ ‚ “ ” „ † ‡ • … ‰ ‹ › ※ ‽ ⁂ ⁄ € ™ ← ↑ → ↓ ⇧ √ ∞ ∴ ∵ ≈ ≠ ⌃ ⌘ ⌥ ◊ ●  ★ ☆ ☜  ☞ ☟  ✎
   _
   𓋆 . 𓆃 . 𖠋 . 𖥳 .𖠛 .𖣂 .𓂐.ᝰ‌ . ꫂ . 𓂀 . 𝆹𝅥𝅮 .𓊮 .𓇼 .𓄯 .𓄧 . 𓆦 . 𓍴 . 𓌗 .⸙ .𓂇 .

   ꕤ . ⋆ . ꕥ . ➺ . ᤑ .  ײַ  . ঌ . ༯ .𖣔 .𖤐 . 
   あ . ⊀ .  . 𓃚 .𖤍. 𖣴 . 𖤐.
   __`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^زخرفات للاستمارات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `┓──⏣──━━──⏣──┏
┛──⏣──━━──⏣──┗
┏─━═║✠║◦◈◦║✠║═━─┓
┗─━═║✠║◦◈◦║✠║═━─┛
┌━─━─═⊱⋟⋞⊰═─━─━┐
└━─━─═⊱⋟⋞⊰═━──━┘
*╮⟐┤────◈❨🎩❩◈────├⟐╭*
╯⟐┤────◈❨🎩❩◈────├⟐╰
╗⟐━───━┓🎩┏━───━⟐╔

╝⟐━───━┛🎩┗━───━⟐╚
*╔═╼─╾═【🎩】═╼─╾═╗*
*╚═╼─╾═【🎩】═╼─╾═╝*
╮─═══─ • ❯ 🎩 ❮ • ─═══─╭
╯─═══─ • ❯ 🎩 ❮ • ─═══─╰
╭━═════₪🎩₪═════━╮
╰━═════₪🎩₪═════━╯
┏═───═⊱⬩⊰🎩⊱⬩⊰═───═┓
┗═───═⊱⬩⊰🎩⊱⬩⊰═───═┛
╔════✦❖✦════╗
╚════✦❖✦════╝
╔──────¤🎩¤──────╗
╚──────¤🎩¤──────╝
╮─═══─ • ❯ ✣ ❮ • ─═══─╭


╯─═══─ • ❯ ✣ ❮ • ─═══─╰
╭━─━─━─≪ ஜ▲ஜ ≫─━─━─━╮

╰━─━─━─≪ ஜ▲ஜ ≫─━─━─━╯
╒─━━━━━━⊱❉⊰━━━━━━─╕

╙─━━━━━━⊱❉⊰━━━━━━─╜`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^زخرفات للاستمارات$/i.test(m.text) ) { //sem prefixo 
             conn.reply(m.chat, `༺━┈┈┉ ⊱╠✣╣⊰ ┉┈┈━༻
◆═══ • ═  •༺ ◈ ༻• ═ • ═══◆
●━── ⊱•┇«🎩»┇•⊰ ──━●
*◉━━━─ •
❮━─━── ༺✯༻──━─━❯꧁____﷽____꧂
♔︎━━━━♕︎﷽♕︎━━━━♔
──════• 〚﷽〛•════──
═ ■ ══  [﷽] ══ ■ ═
◆━─━─━┊﷽┊━─━─━◆
༺═⚌═══(﷽)═══⚌═༻
──════• 〚〛•════──
                                           O◄┢┅͜͡✇━⟬━✇͜͡┅┧►O
❅•━─━❨﷽❩━─━•❅
╮━─━─━≪『﷽』≫━─━─━╭
*❅ ━━━━ » ✥ «﷽» ✥ « ━━━━ ❅
༺═━━═⊱╊⊰✺⊱╉⊰═━━═༻  ༺━───━【❂】━───━༻
❖༻⚌╍⚌╍⚌⌬⚌╍⚌╍⚌༺❖
༺❯════⊰༽﷽༼⊱════❮༻
༺❯════⊰༽༼⊱════❮༻
❉••••••••┇﷽┇••••••••❉

 *࿇═════⊰⁦⁩⊱═════࿇ *
❐─━─━─━⇜✦⇝━─━─━─❐
❆═⊷✶⊷═⊷✦⊷✶⊷═⊷═❆
 ⋄━───═◞⬪⋇⬪◟═───━⋄
⬩═─────═❊═─────═⬩
⊱⊹╾╾╾──❯┃┃❮──╼╼╼⊹⊰
❐═━━━═╊⊰🔆⊱╉═━━━═❐
 ❐─━─━─━⇜✦⇝━─━─━─❐
*❃═⚌═══⏣⊰⊱⏣ ═══⚌═❃
─━━━━━━ ❋ ━━━━━━─
⌬═════||═════⌬*
━────═۞═────━* ═─━─━─•⊰𖣐⊱•─━─━─═‏⊱⊹────❯✺❮────⊹⊰
⊱─━─⊱✬✬⊰─━─⊰
❴✾❵──━━━━❨❩━━━━──❴✾❵
━────≪✾ ✾ ✾≫─────━
❅ ━━━━ » ✥ «♕» ✥ « ━━━━ ❅
✠ ━━ • ━ ‹✤› ━ • ━━ ✠ *♔︎━━━━♕︎♕︎━━━━♔                                                         ━─────𖦹𖧷𖦹─────━
──════• 〚〛•════──
●━━━━━━━✦◆✦━━━━━━━●
┃❐━━═━═✦◈❨❩◈✦═━═━━❐┃
 ❐─━──━〘•⊰❉⊱•〙━──━─❐
 ━━━━━━❰･❉･❱━━━━━━
 ❐─━──━〘•⊰❉⊱•〙•━──━─❐
 ❐─━──━〘•⊰❉⊱•〙━──━─❐
 ✤━═━━❂〘••〙❂━━━━✤
✠ ━━ • ━ ‹✤› ━ • ━━ ✠ ⬩═─────═❊═─────═⬩
━─━───⊱⋅⋄⋅⊰───━─━
❰━───━✣⊰✤⊱✣━───━❱
━━ ═━╃✦⊰✺⊱✦╄━━ ═━
━━ ═━╃⊰✺⊱╄━━ ═━
〄━━━━━⌬〔〕⌬━━━━━〄
✥━═━═• 《•❉•》•═━═━✥
❃━═━═✦•〘• ❉ •〙•✦═━═━❃
≪═━━━━━━⊱♟⊰━━━━━━═≫
✥━─━─━⌬〘〙⌬━─━─━✥
༺━━━━─╃⌬〔〕⌬╄─━━━━༻
⊱◦⊹━━━─━✺━─━━━⊹◦⊰
✺━─━━⊹◦⊰🔆⊱◦⊹━━─━✺
⊱⊹────❯✺❮────⊹⊰
┃✺❯──────────❮✺┃
❮✺┃╼╾╼╾⊱🎩⊰╼╾╼╾┃✺❯
╼╾╼╾⊱⊹╊🔆╉⊹⊰╼╾╼╾
« ════ •「」• ════ »
𖣘━━═════『』════━━𖣘
╆ ✾ ━━━━❨❩━━━━ ✾╆
⊱┈ ┄ ┉┅━✥✥━┅┉ ┈ ┈⊰
⊱━━━━⊰✾⊱━━━━⊰
⟞⟞⟞⟞⟞✫✪✫⟝⟝⟝⟝⟝
❛━━━━━━━ ••• ━━━━━━━❜
━────── •●• ──────━
• ━━━━━━❪❆❫━━━━━━ •
‏══════ஜ▲ஜ══════
• ═ ═ ═══ • ═══ ═ ═ •
◤━───━ ◆ ━───━◥
⟥─────✤─────⟤
══════⊹⊱≼≽⊰⊹══════
⊱⋅ ────── ❴ • ✿ • ❵ ────── ⋅⊰
─══─━══─| ✠ |─══━─══─
⚊⚊⚊⚊⚊⚊✬ ✥ ✬⚊⚊⚊⚊⚊⚊
✿❯────「✿」────❮✿
───≪•◦❈◦•≫───•
─━─━─━∞◆∞━─━─━─
· · • • • ✤ • • • · ·
━━━━━━❰･❉･❱━━━━━━
❰━────━ ✣⊰✤⊱✣ ━────━❱
✺━─━──━─━✺
*❜ ━─━─━『♤』━─━─━ ❛
◈ ━━━━━━━ ⸙ ━━━━━━━ ◈
◆━━━━━━◆❃◆━━━━━━◆
❋・────━【❆】━────・❋
࿇ ══━━━━✥◈✥━━━━══ ࿇
*≪═━━━━━⊱••⊰━━━━━═≫*‏`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

             } if (/^زخرفة للاستمارات$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `⋄━───═◞⬪⋇⬪◟═───━⋄
 ◦❪╭╯❫◦

╚╩━───╼◦⊰✢⊱◦╾───━╩╝
┏─━═║✠║◦◈◦║✠║═━─┓

┗─━═║✠║◦◈◦║✠║═━─┛
┓──⏣──━━──⏣──┏


┛──⏣──━━──⏣──┗
╮⟐┤────◈❨✦❩◈────├⟐╭

 ᚛⌊⌉᚜

⬩═─────═❊═─────═⬩

    ↫╿╿↬

⬩═─────═❊═─────═⬩
    ❐ ⟪ ⟫ ❐

 ❖〖〗❖
 ⬩═─────═❊═─────═⬩

◃◂◃◂᚛⌊▾
▴⌉᚜▹▸▹▸

╯⟐┤────◈❨✦❩◈────├⟐╰
⦁⦁⦁❩⟐⟐❨⦁⦁⦁
╔⟐━───━┓⏣┏━───━⟐╗

       【】➥

━─━───⊱⋅⋄⋅⊰───━─━
۞║║۞
⦁
⦁
۞║: ⇩⇩║۞
⦁
⦁
⇚◈〖〗◈
━─━───⊱⋅⋄⋅⊰───━─━

╚⟐━───━┛⏣┗━───━⟐╝
⦁⦁⦁❩ ◦
◦ ❨⦁⦁⦁
┌━─═⊱⋟⋞⊰═─━┐
❍....... ❍
❍...... ❍
└━─═⊱⋟⋞⊰═─━┘
【❖❘ ❘❖】 

╔═╼──╾═【🔆】═╼──╾═╗

    ──⧉【  】⧉──

❖༻⚌╍⚌╍⚌⌬⚌╍⚌╍⚌༺❖
❐༻❯══༽ ༼

❐༻❯══༽ ༼

❐༻❯══༽༼
❖༻⚌╍⚌╍⚌⌬⚌╍⚌╍⚌༺❖
 «⳺⳻»

╚═╼─╾═【🔆】═╼─╾═╝

【 ☰ 🔆 ˼‏˹ 】

 ❐─━─━─━⇜✦⇝━─━─━─❐
  ⧼⬪│ ☾🔆☽ │⬪⧽ 
  ༺━───━【❂】━───━༻
 ❐─━─━─━⇜✦⇝━─━─━─❐
⎝┈──┉─┉『🔆』┉─┉──┈⎞
⏠⏠⏠⏠⏠⏠⏠
⏡⏡⏡⏡⏡⏡⏡
◂⟦⟧

◂⟦⟧

✾⎦⎡≻≺⎤⎣✾
❐═━━━═╊⊰🔆⊱╉═━━━═❐
❐『』
⇦【】

༺═━━═⊱╊⊰⏣⊱╉⊰═━━═༻

✺❯╼╾╼╾ ╭╰🔆╯╮ ╼╾╼╾❮✺
 
 «⋅⋄⌊⌉⋅⋄»

┏═───═⊱⬩⊰🔆⊱⬩⊰═───═┓

« •「   」• »

 
┗═───═⊱⬩⊰🔆⊱⬩⊰═───═┛

⊱⊹╾╾╾──❯┃┃❮──╼╼╼⊹⊰

    ⟮⎙⟯⟮  ⟯⟮⎙⟯

┉─────↜⋋⏣⋌↝─────┉


❮✺┃╼╾╼╾⊱🔆⊰╼╾╼╾┃✺❯

⊱⊹────❯✺❮────⊹⊰
▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█ █▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█
⏎
⌬═════||═════⌬
━────═۞═────━
〘〙
╙
╓
╕
╜
❋
❉
⊰⊱
─━━━━━━ ━━━━━━─
*═─━─━─•⊰𖣐⊱•─━─━─═*‏
↝ ↞ ↟ ↠ ↡ ↢ ↣ ↤ ↥ ↦ ↧ ↨ ↩️ ↪️ ↫ ↬ ↭ ↮ ↯ ↰ ↱ ↲ ↳ ↴ ↵ ↶ ↷ ↸ ↹ ↺ ↻ ↼ ↽ ↾ ↿ ⇀ ⇁ ⇂ ⇃ ⇄ ⇅ ⇆ ⇇ ⇈ ⇉ ⇊ ⇋ ⇌ ⇍ ⇎ ⇏ ⇐ ⇑ ⇒ ⇓ ⇔ ⇕ ⇖ ⇗ ⇘ ⇙ ⇚ ⇛ ⇜ ⇝ ⇞ ⇟ ⇠ ⇡ ⇢ ⇣ ⇤ ⇥ ⇦ ⇧ ⇨ ⇩ ⇪ ⇫ ⇬ ⇭ ⇮ ⇯ ⇰ ⇱ ⇲ ⇳ ⇴ ⇵ ⇶ ⇷ ⇸ ⇹ ⇺ ⇻ ⇼
❃═⚌═══⏣⊰⊱⏣ ═══⚌═❃
﷽
┃❐━═━═✦◈❨🔰❩◈✦═━═━❐┃
╭━─━─━≪『﷽』≫━─━─━╮
❦
 ❐─━──━〘•⊰❉⊱•〙━──━─❐
 ━━━━━━❰･❉･❱━━━━━━
 ❐─━──━〘•⊰❉⊱•〙•━──━─❐
 ❐─━──━〘•⊰❉⊱•〙━──━─❐
 ✤━═━━❂〘••〙❂━━━━✤`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } if (/^أنذار$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*⌝ اعــلان إنــذار╎🚨 ⌞*
*↻╍╍━┛👑┗━╍╍↺*

*❖↫┋الـلــقــب 👤╎」*

*❖↫┋الـمـنـشـن 📧╎」*

*❖↫┋الـسـبـب ⁉️╎」*

*❖↫┋الـخـصـم  📈╎」*

*❖↫┋عـدد الإنـذارات 📟╎」*

*↻╍╍━┛👑┗━╍╍↺*
*⨀⇠ تــوقــيــع ⇣*  
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

     } 

   
   
 return !0 } 

handler.admin = true
handler.group = true
handler.botAdmin = true
handler.fail = null
 export default handler