let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*╮─━━⊱𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃⊰━*

*『 ${pickRandom(global.nkt)} 』*

*╯─━━⊱𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃⊰━*`, m)
}
handler.help = ['bzmzjdks']
handler.tags = ['fun']
handler.command = /ضحكني|نكت/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.nkt = [ 

`واحد ماسك الريمونت🤳 😂😂 والثاني مغطي الرسيفر🙁✋😂😂
،\`،
قصة لن 
يفهمها إلا الإخوة الأعداء😂☻💔`,
   `دكتور في مستشفى النفسية : 
شغل للمجانين شريط اغاني 
رقصو كلهم ما عدا واحد 
استانس الدكتور وقال : اكيد هذا العاقل فيهم !
قاله : ليش  ما رقصت؟
قال انا العرووسه👰

إنَـٱ للھٓ وإنَـآ آليه رآجعون
#ههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههۂ٧ۂۂ٧ة ˛⁽ 🤣🍻 ₎ ˛ ∅`,
   `محشش قاعد مع واحد كذاب 

الكذاب يقول أنا عايش من أيام ما كان 

قوس قزح أبيض وأسود قال المحشش 

عادي طيب أنا عايش من أيام ماكان😳 
البحر الميت مريض .

✌️🏻😂😆😜😆😂😜😆😂😜😆✌️🏻
`,
   `اليمني  فريد من نوعه
عنده أمنيات غريبه :

١) يشتي ينجح بدون مذاكرة 😌
٢) يشتي راتب بدون شغل 
٣) يشتي وظيفة بدون دوام
٤) يشتي جسم حلو بدون تمرين

وأقوى شي ٠٠٠٠٠٠٠٠٠٠
😭😂😂😂😭😭😁😳
٦) يشتي يموت ساجد وهو ما يصلي 😌
مايصير هذا يا صاحبنا

      😂😂😂😂😂`,
   `😂
اكثر ولد كرهته ‏​في صفنا
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    

الذي يقول :
^استاذ ما فتشت الواجب  

ايش دخل امك  فتشوا  راسك ياعديم الاحساس غيرك ماحل
😒😒😒😁😂
`,
   `_
‏من طرائف العرب😁 :   
قال رجل لآخر  :
( اصمُت وإلا لطمتُك لطمةً تذهب بك إلى يثرب ) 
فقال :
( عززها  بأخرى لعل الله يرزقني الحج على يديك ) 😂 .
🤣🤣🤣🤣
`,
   `  ツ

واحد يقول لزوجته : 
ايش شعورك لما تجلسي 4 ساعات وانتي تطبخي وانا في اقل من دقيقة آڪلها !
قالت له : نفس شعورك في الراتب لما تشتغل طوول الشهر وانا لفة وحدة في السوق انعثه !! 

  ڪُل وانت ساڪت يا أخي 
     لازم تنڪد على نفسك🤦🏻‍♂🤣🤣🤣
#هههههههههههههههههههههههههههههههههههههههههههههههههههههههههههہ😹😹😹😹😹💔
`,
   `‏سأل رجل امرأة :
‏
‏لماذا خلقتم جميلات و ناقصات عقل ؟
‏
‏فأجابت : 
‏
‏جميلات لتحبونا وناقـصات عـقل لنحبكم
‏
‏جالس احك جبهتي وانا مالي دخل 
‏
‏ 😂😂😂😂😂`,
   `‏وجد هارون الرشيد أبو نوّاس ومعه خمر
فـ سأله : ماذا بيدك؟

قال: لبن ..
فقال : وهل اللبن أحمر..!
فـ رد : لقد إحمرّ خجلاً منك يا أمير المؤمنين"̮

من هنا بدأ فن التصريف"̮😂😂`,
   `👩🏻‍🦳 : تعرفين تطبخين ؟
‌👩🏻‍🦱⁩ : اي اكيد 
👩🏻‍🦳 : وشنو تعرفين تسوين ؟

‌👩🏻‍🦱⁩ : احرك لأمي #البصل وهي تكمل الباقي .☺️😂🏃‍♀💔💦`,
   `النسوان   في البيت
 يا راسي / يا رجلي  / ياظهري
وفي السوق تشوفها ميسي في هجمة مرتده.
😂😂😂😂😂😂😂

والرجال في الرحلات 
يصير منال العالم 
وفالبيت مايعرف يحط جبنه على خبزه 
😂😂😂😂😂😂😂‏😂😂😂😂😂😂😂😂😂😂😂`,
   `#الحب : هو حب الاكل 🌮🍔🍗
#الفراق : هو انقطاع النت💔🙂
#الألم:  لما تضرب اصبع رجلك الصغير بالطاولة😭
#الخداع: لما تحط تلفونك  ع الشاحن  وتلاقيه ما شحن😤
#الخـيانه : لما تلاقي  اكياس الشيبس  مرمية بالسلة😳😭
#الغدر : لما تحط حاجه  بالبراد وتجي ما تلاقيها💔
#حرفياً_من_يتفق_معي 🌚🦦`,
   `°°

_👩🏻:حبيبي وينك الأن.. 
👱🏼‍♂:في حديقة الحيوانات
👩🏻: سرت تزور أهلك.. 
👱🏼‍♂ :لا سرت أتقدم من عند أهـــلش🤕😹
#بـــوووووووووووووووم..⁽💔☻₎ء.`,
   `:
: ‏الاجهزة الذكية❗️

ستبقى غبية
حتى تشحن نفسها بنفسها ! 

انتهى الكلام 🌚
🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣`,
   `كل الكذبات انقرضت إلا 5 دقايق وانا عندك


ـ مازال سوقها ماشي
😂😂😂😂😂😂😂😂😂😂😂`,
   `💔😂
جاهل دخل مع ابوه البقاله قال لابوه
يا ابه انا احب الشوكولاته

فقال الاب حبها وردها مكانها
#الدنيا_حراف
😂😂😂😂😂😂😂😂😂😂😂`,
   `:
السلام عليكم ورحمه الله وبركاته ان الحمد لله نحمده ونستعينه ونستغفره ونتوب اليه ونعوذ بالله من شرور انفسنا وسيئات اعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له اخواني المسلمين اما بعد :


              - زوجوني  ᴗ🌚💦😿💔😂`,
   
 ] 