   import { createHash } from 'crypto'
import PhoneNumber from 'awesome-phonenumber'
import { canLevelUp, xpRange } from '../lib/levelling.js'
import fetch from 'node-fetch'
import fs from 'fs'
const { levelling } = '../lib/levelling.js'
import moment from 'moment-timezone'
import { promises } from 'fs'
import { join } from 'path'
const time = moment.tz('Egypt').format('HH')
let wib = moment.tz('Egypt').format('HH:mm:ss')
//import db from '../lib/database.js'

let handler = async (m, { conn, usedPrefix, command}) => {
    let d = new Date(new Date + 3600000)
    let locale = 'en'
    let week = d.toLocaleDateString(locale, { weekday: 'long' })
    let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)
let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
if (!(who in global.db.data.users)) throw `✳️ The user is not found in my database`
let pp = './src/menu.jpg'
let user = global.db.data.users[who]
let { name, exp, diamond, lastclaim, registered, regTime, age, level, role, warn } = global.db.data.users[who]
let { min, xp, max } = xpRange(user.level, global.multiplier)
let username = conn.getName(who)
let math = max - xp
let prem = global.prems.includes(who.split`@`[0])
let sn = createHash('md5').update(who).digest('hex')
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850) 
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let str = `*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*
*↻╍╍━┛👑┗━╍╍↺*
*□مرحبا بـك ياعزيزي في بوت لووفي* 

 *🤖شبيك لبيك بوت لووفي بين يديك🤖*
*↻╍╍━┛👑┗━╍╍↺*
 *□مـلاحظـات هاامـة⁉️* 

*▪︎البوت لا يعمل الا عبر الاوامر وكل امر لابد ان يبدا بنقطه 𓆩.𓆪*
*▪︎أكثر امور البوت لازم تحتوي على منشن لشخص المقصود*
*▪︎ارفعع البوت اشراف لتتمكن من استخدم كل اوامرة*
*↻╍╍━┛👑┗━╍╍↺*
*-👑يمكنك مراسللة 𓆪نـاغي سـان𓆩*

*『اذا واجهتك اي مشككلة في البوت او اذا كانت لديك اوامر للبوت وتريد اضافاتها❕』*
*↻╍╍━┛👑┗━╍╍↺*
*👑رقم مطـور بووت لووفي🤩⚜️* 
*『 https://wa.me/+967714075210 』*
*↻╍╍━┛👑┗━╍╍↺*
 *『والمـزيد من الاوامر التي ستتم أضافتها للبوت بأذن الله لمتابعت أخر أخبار البوت أنظم إلى قروب تحديثات البوت🤖👇🏻』*
*↻╍╍━┛👑┗━╍╍↺*
*-🤖رابط قروب تحديثات البوت ❕*
*『 https://chat.whatsapp.com/IpftHHFJbXoDdufbuS7YmY 』*
*↻╍╍━┛👑┗━╍╍↺*

■ *『شــرح استخدام البـوت 🤖』*

*˼‏📜˹ قـسـم الـمـجـمـوعـات╿↶*
*『❍↜╎.منشن』*
*𓆩منشن لجميـع أعضاء القروب𓆪*
*『❍↜╎.مخفي』*
*𓆩منشن مخفي لجميع أعضاء القروب وتستطيع ان تكتب كلام ليتوجةة لههم𓆪*
*『❍↜╎.ضيف』*
*𓆩للأضافة شخص للقروب ويكتب(.ضيف مع رقم هاتف الشخص المراد أضافتة) 𓆪*
*『❍↜╎.طرد』*
*𓆩لطرد شخص من القروب ويكتب (.طرد مع منشن لشخص المراد طردة) 𓆪*
*『❍↜╎.ترقيه』*
*𓆩لترقية شخص إلى اشراف بالمجموعة𓆪*
*『❍↜╎.اعفاء』*
*𓆩لتتزيل شخص من الاشراف إلى عضوو عادي𓆪*
*『❍↜╎.حذف』*
*𓆩لحذف رسالة بشكل نهائي من القروب𓆪*
*『❍↜╎. دعوه』*
*𓆩لدعوة شخص للانضمام للقروب ويستخدم(.دعوة ثم تضع رقم الشخص بدون علامة الـ[+]) 𓆪*
*『❍↜╎. تغيير_اللينك』*
*𓆩لتغيير رابط المجموعةة𓆪*
*『❍↜╎.جروب غلق』*
*𓆩لغلق القروب ولا يستطيعون الاعضاء ارسال الرسائل𓆪*
*『❍↜╎.جروب فتح』*
*𓆩لفتح القروب للأعضاء ليتمكنو من ارسال الرسائل𓆪*
*『❍↜╎.انذار』*
*𓆩لأنذار عضو خالف القوانين𓆪*
*『❍↜╎.الانذارات』*
*𓆩لمعرفة كم لديك أنذارات بالقروب𓆪*
*『❍↜╎.حذف_تحذير』*
*𓆩لحذذف انذار عضوو𓆪*
*『❍↜╎.المشرفين』*
*𓆩يسووي منشن للمشرفين فقط.! 𓆪*
*-مـلاحظةة ⁉️*
*-جميع هذة الأوامر يستطيـع مشرفين المجموعة أستخدامهها وليس الأعضاء❕*
*↻╍╍━┛👑┗━╍╍↺*
*˼‏👥˹ قـسـم الاعـضـاء╿↶*
*『❍↜╎.خط』*
*𓆩لتغيير خط كللمة باللغة الإنجليزية𓆪*
*『❍↜╎.مكس』*
*𓆩تستخدم لدمج ٢ ايموجي مع بعض𓆪*
*『❍↜╎.هل』*
*𓆩لعرض اسئالة تخيير بين شيئين𓆪*
*『❍↜╎.توب』*
*𓆩يمنشن لك 10 اعضاء على حسب اختيارك مثل (توب الاذكياء-الاغبياء) 𓆪*
*『❍↜╎.ايات』*
*𓆩البوت يجيب لك أيات صغيرة من القرآن الكريم𓆪*
*『❍↜╎.بوست』*
*𓆩يقوم البوت بأرسال بوستات عشوائية𓆪*
*『❍↜╎.المطور』*
*𓆩البـوت يجيب لك رقم المطور𓆪*
*『❍↜╎.كت』*
*𓆩يستخدم هذا الامر للمنافسات الكتابة حيث البوت يرسل اسم شخصية انمي واسرع من يكتبها يفوز𓆪*
*『❍↜╎.اك』*
*𓆩تستخدم لمنافسات الكتابة ذات الدرجة الثانية حيث البوت يرسل اسم شخصيتين انمي𓆪*
*『❍↜╎احزر』*
*𓆩يرسل لك البوت صورة شخصية انمي وانت عليك ارسال اسمهها𓆪*
*『❍↜╎ميمز』*
*𓆩يررسل لك البوت صورة مميزة من الانمي𓆪*
*『❍↜╎.زواج』*
*𓆩يقوم البوت بتزويجك عشوائي𓆪*
*『❍↜╎.تطقيم』*
*𓆩يرسل لك البوت صورتين تطبيق الاولى للولد والثانية للبنت𓆪*
*『❍↜╎.ستك』*
*𓆩يصنع لك البوت ملصق على حسب كلامك مثلل(. ستك ناغي عمكم) 𓆪*
*『❍↜╎.ارسم』*
*𓆩يقوم البوت برسم شخصية التي تريدها𓆪*
*『❍↜╎.انطق』*
*𓆩يستخدم هذا الامر لترجيع الكتابة الى مقطع صوت𓆪*
*『❍↜╎.لفل』*
*𓆩لمعرفة كم مستواك بالبوت𓆪*
*『❍↜╎.الجروب』*
*𓆩لمعرفةة معلومات القروب𓆪*
*『❍↜╎.بروفايل』*
*𓆩لمعرفة معلومات ملفك الشخصي𓆪*
*-ملاحظةة ⁉️*
*-يستطيـع الجمييع استخـدام هذة الاوامر📑*
*↻╍╍━┛👑┗━╍╍↺*
*˼‏⏬˹ قـسـم الـتـحـمـيـل╿↶*
*『❍↜╎.فيسبوك』*
*𓆩لتحميل مقطع فيديو او صورة من الفيسبوك𓆪*
*『❍↜╎.انستغرام』*
*𓆩لتحميل مقطع فيديو او صورة من الانستغرام𓆪*
*『❍↜╎.تيكتوك』*
*𓆩لتحميل مقطع فيديو من التيك توك𓆪*
*『❍↜╎.درايف』*
*𓆩لتحميلل من تطبيق درايف𓆪*
*『❍↜╎.ميديافاير』*
*𓆩لتحميلل من تطبيق ميديا فاير𓆪*
*『❍↜╎.شغل』*
*𓆩يعطيك اي فيديو تريد من اي منصةة𓆪*
*『❍↜╎.بحث』*
*𓆩للبحث في جوجل𓆪*
*『❍↜╎.صورة』*
*𓆩لتحميل اي صورة تريد ويكتب(.صوره ناغي) 𓆪*
*『❍↜╎.تطبيق』*
*𓆩ويستخدم لتنزيل اي تطبيق تريدة يرسلة اليك البوت مثل(. تطبيق pinterest𓆪*
*-ملاحظـةة ⁉️*
*-اذا كنت تريد تحميلل مقطع فيديو يرجى ارسال رابط المقطع للبوت حتى يعطيك المقطع المطلوب🎥*
*↻╍╍━┛👑┗━╍╍↺*
*˼‏♻️˹ قـسـم الـتـحـويـل╿↶*
*『❍↜╎.ملصق』*
*𓆩يحوول لك الصورة إلى مللصق𓆪*
*『❍↜╎.سرقة』*
*𓆩يغيير حقوق الملصق مثل مابدكك𓆪*
*『❍↜╎.لصورة』*
*𓆩يحوول الملصق إلى صورة𓆪*
*『❍↜╎.لفيديو』*
*𓆩يحوول الملصقق المتحرك إلى فيديو𓆪*
*『❍↜╎.لانمي』*
*𓆩يحوول صورة الإنسان الطبيعي إلى أنمي𓆪*
*『❍↜╎.ترجم』*
*𓆩يترجم لك اللغات إلى اللغة العربية𓆪*
*-ملاحظـةة ⁉️*
*-أغللب هذة الامور تحتاج إلى جواهر لتتمكن من استخدامهها 💎*
*↻╍╍━┛👑┗━╍╍↺*
*˼‏🎮˹ قـسـم الـتـرفـيـه╿↶*
*『❍↜╎.اكس』*
*𓆩هيي لعبة مسلية يستطيع ان يلبعها شخصين ويتم عن طريقها تجميع الـ أكس بي والجواهر𓆪*
*『❍↜╎.حذففف』*
*𓆩اذا دخلت جيم في لعبة اكس وتريد الخروج منة تستخدم هذا الامر𓆪*
*『❍↜╎.جميل』*
*𓆩لمعررفة كم نسبة جمال الشخص𓆪*
*『❍↜╎.ورع』*
*𓆩لمعرفة كم نسبة ان يكون الشخص ورع𓆪*
*『❍↜╎. زواج』*
*𓆩يقووم البوت يتزويج شخصين عشوائييً𓆪*
*『❍↜╎.خروف』*
*𓆩ليقول لك البوت من هو خروف هذة المجموعة𓆪*
*『❍↜╎.لو』*
*𓆩يعطيكك البوت اسئالة تخيرك بين شييئين وانت عليك اختيار احداهما𓆪*
*『❍↜╎.صراحه』*
*𓆩يعطيك البوت اسئالة صراحة وانت عليك الإجابة بصراحةة𓆪*
*『❍↜╎.تحدي』*
*𓆩يستخدمم هذا الامر لتحدي بينك وبيت البوت𓆪*
*『❍↜╎.قطة』*
*𓆩يجيب لك صورة لقطة𓆪*
*『❍↜╎. شخصية』*
*𓆩يقول لك شخصية شخص𓆪*
*-ملاحظـةة ⁉️*
*-أغللب هذة الامور تحتـاج الى منشن لشخص الذي تريد معرفتة 🌀*
*↻╍╍━┛👑┗━╍╍↺*
*『👑┇𝙻𝚄𝙵𝙵𝚈┇🤖┇𝙱𝙾𝚃┇👑』*`
    conn.sendFile(m.chat, pp, 'perfil.jpg', str, m, false, { mentions: [who] })

}
handler.help = ['main']
handler.tags = ['group']
handler.command = ['شرح'] 

export default handler
function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
    
    function ucapan() {
      const time = moment.tz('Asia/Kolkata').format('HH')
      let res = "بداية يوم سعيده ☀️"
      if (time >= 4) {
        res = "صباح الخير 🌄"
      }
      if (time >= 10) {
        res = "مساء الخير ☀️"
      }
      if (time >= 15) {
        res = "مساء الخير 🌇"
      }
      if (time >= 18) {
        res = "مساء الخير 🌙"
      }
      return res
    }
